// 내 머릿속의 생각을
// 코드로 구현하는게 어렵다. 

// 1~10

// 계산결과를 저장하고 있을 변수를 선언한다.  
// 그 변수의 값을 0으로 초기화 한다. 

// 변수 : 0
// 그 변수에 1을 더한 값을 그 변수에 넣는다. 
// 변수 : 변수 + 1 = 1;
// 변수 : 1
// 그 변수에 2을 더한 값을 그 변수에 넣는다. 
// 변수 : 변수 + 2 = 3;
// 변수 : 3
// 그 변수에 3을 더한 값을 그 변수에 넣는다. 
// 그 변수에 4을 더한 값을 그 변수에 넣는다. 
// 그 변수에 5을 더한 값을 그 변수에 넣는다. 
// ... 
// 그 변수에 10을 더한 값을 그 변수에 넣는다. 

let sum = 0;

sum = sum + 1;
sum = sum + 2;
sum = sum + 3;
sum = sum + 4;
sum = sum + 5;
sum = sum + 6;
sum = sum + 7;
sum = sum + 8;
sum = sum + 9;
sum = sum + 10;

console.log(sum);



